# carga datos con read_csv()

In [1]:
import pandas as pd
import os

In [2]:
mainpath = "/home/lexus72/github/python-ml-course/datasets"
filename = "titanic/titanic3.csv"
fullpath = os.path.join(mainpath, filename)

In [3]:
df = pd.read_csv(fullpath)

In [4]:
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [5]:
df.tail()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1304,3,0,"Zabour, Miss. Hileni",female,14.5,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [6]:
df.head

<bound method NDFrame.head of       pclass  survived                                             name  \
0          1         1                    Allen, Miss. Elisabeth Walton
1          1         1                   Allison, Master. Hudson Trevor
2          1         0                     Allison, Miss. Helen Loraine
3          1         0             Allison, Mr. Hudson Joshua Creighton
4          1         0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
...      ...       ...                                              ...
1304       3         0                             Zabour, Miss. Hileni
1305       3         0                            Zabour, Miss. Thamine
1306       3         0                        Zakarian, Mr. Mapriededer
1307       3         0                              Zakarian, Mr. Ortin
1308       3         0                               Zimmerman, Mr. Leo

         sex      age  sibsp  parch  ticket      fare    cabin embarked boat  \
0     female  29.0000      0      0   24160  211.3375       B5        S    2
1       male   0.9167      1      2  113781  151.5500  C22 C26        S   11
2     female   2.0000      1      2  113781  151.5500  C22 C26        S  NaN
3       male  30.0000      1      2  113781  151.5500  C22 C26        S  NaN
4     female  25.0000      1      2  113781  151.5500  C22 C26        S  NaN
...      ...      ...    ...    ...     ...       ...      ...      ...  ...
1304  female  14.5000      1      0    2665   14.4542      NaN        C  NaN
1305  female      NaN      1      0    2665   14.4542      NaN        C  NaN
1306    male  26.5000      0      0    2656    7.2250      NaN        C  NaN
1307    male  27.0000      0      0    2670    7.2250      NaN        C  NaN
1308    male  29.0000      0      0  315082    7.8750      NaN        S  NaN

       body                        home.dest
0       NaN                     St Louis, MO
1       NaN  Montreal, PQ / Chesterville, ON
2       NaN  Montreal, PQ / Chesterville, ON
3     135.0  Montreal, PQ / Chesterville, ON
4       NaN  Montreal, PQ / Chesterville, ON
...     ...                              ...
1304  328.0                              NaN
1305    NaN                              NaN
1306  304.0                              NaN
1307    NaN                              NaN
1308    NaN                              NaN

[1309 rows x 14 columns]>

In [7]:
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [8]:
data2 = pd.read_csv(mainpath + "/" + "customer-churn-model/Customer Churn Model.txt")

In [9]:
data2.head()

,State,Account Length,Area Code,Phone,Int'l Plan,VMail Plan,VMail Message,Day Mins,Day Calls,Day Charge,...,Eve Calls,Eve Charge,Night Mins,Night Calls,Night Charge,Intl Mins,Intl Calls,Intl Charge,CustServ Calls,Churn?
0,KS,128,415,382-4657,no,yes,25,265.1,110,45.07,...,99,16.78,244.7,91,11.01,10.0,3,2.70,1,False.
1,OH,107,415,371-7191,no,yes,26,161.6,123,27.47,...,103,16.62,254.4,103,11.45,13.7,3,3.70,1,False.
2,NJ,137,415,358-1921,no,no,0,243.4,114,41.38,...,110,10.30,162.6,104,7.32,12.2,5,3.29,0,False.
3,OH,84,408,375-9999,yes,no,0,299.4,71,50.90,...,88,5.26,196.9,89,8.86,6.6,7,1.78,2,False.
4,OK,75,415,330-6626,yes,no,0,166.7,113,28.34,...,122,12.61,186.9,121,8.41,10.1,3,2.73,3,False.

# mostrar valores de las columnas

In [10]:
data2.columns.values

array(['State', 'Account Length', 'Area Code', 'Phone', "Int'l Plan",
       'VMail Plan', 'VMail Message', 'Day Mins', 'Day Calls',
       'Day Charge', 'Eve Mins', 'Eve Calls', 'Eve Charge', 'Night Mins',
       'Night Calls', 'Night Charge', 'Intl Mins', 'Intl Calls',
       'Intl Charge', 'CustServ Calls', 'Churn?'], dtype=object)

## cambiar cabecera

In [11]:
data_cols = pd.read_csv(mainpath + "/" + "customer-churn-model/Customer Churn Columns.csv")
data_col_list = data_cols["Column_Names"].to_list()
data2 = pd.read_csv(mainpath + "/" + "customer-churn-model/Customer Churn Model.txt", header=None, names=data_col_list)
data2.columns.values
data2.head()

,A,B,C,D,E,F,G,H,I,J,...,L,M,N,O,P,Q,R,S,T,U
0,State,Account Length,Area Code,Phone,Int'l Plan,VMail Plan,VMail Message,Day Mins,Day Calls,Day Charge,...,Eve Calls,Eve Charge,Night Mins,Night Calls,Night Charge,Intl Mins,Intl Calls,Intl Charge,CustServ Calls,Churn?
1,KS,128,415,382-4657,no,yes,25,265.100000,110,45.070000,...,99,16.780000,244.700000,91,11.010000,10.000000,3,2.700000,1,False.
2,OH,107,415,371-7191,no,yes,26,161.600000,123,27.470000,...,103,16.620000,254.400000,103,11.450000,13.700000,3,3.700000,1,False.
3,NJ,137,415,358-1921,no,no,0,243.400000,114,41.380000,...,110,10.300000,162.600000,104,7.320000,12.200000,5,3.290000,0,False.
4,OH,84,408,375-9999,yes,no,0,299.400000,71,50.900000,...,88,5.260000,196.900000,89,8.860000,6.600000,7,1.780000,2,False.

## metodo open, ejemplos

In [12]:
data3 = open(mainpath + "/" + "customer-churn-model/Customer Churn Model.txt","r")
cols = data3.readline().strip().split(",")
cols

['State',
 'Account Length',
 'Area Code',
 'Phone',
 "Int'l Plan",
 'VMail Plan',
 'VMail Message',
 'Day Mins',
 'Day Calls',
 'Day Charge',
 'Eve Mins',
 'Eve Calls',
 'Eve Charge',
 'Night Mins',
 'Night Calls',
 'Night Charge',
 'Intl Mins',
 'Intl Calls',
 'Intl Charge',
 'CustServ Calls',
 'Churn?']

In [13]:
n_cols = len(cols)
n_cols

21

### encontrar numero de filas

In [14]:
counter = 0
main_dict = {}
for col in cols:
    main_dict[col] = []

In [15]:
main_dict

{'State': [],
 'Account Length': [],
 'Area Code': [],
 'Phone': [],
 "Int'l Plan": [],
 'VMail Plan': [],
 'VMail Message': [],
 'Day Mins': [],
 'Day Calls': [],
 'Day Charge': [],
 'Eve Mins': [],
 'Eve Calls': [],
 'Eve Charge': [],
 'Night Mins': [],
 'Night Calls': [],
 'Night Charge': [],
 'Intl Mins': [],
 'Intl Calls': [],
 'Intl Charge': [],
 'CustServ Calls': [],
 'Churn?': []}

In [16]:
for line in data3:
    values = line.strip().split(",")
    for i in range(len(cols)):
        main_dict[cols[i]].append(values[i])
    counter = counter + 1
print(" el dataset tiene %d filas y %d columnas"%(counter, n_cols))

 el dataset tiene 3333 filas y 21 columnas

### pasar a dataframe

In [17]:
df3 = pd.DataFrame(main_dict)
df3.head()

,State,Account Length,Area Code,Phone,Int'l Plan,VMail Plan,VMail Message,Day Mins,Day Calls,Day Charge,...,Eve Calls,Eve Charge,Night Mins,Night Calls,Night Charge,Intl Mins,Intl Calls,Intl Charge,CustServ Calls,Churn?
0,KS,128,415,382-4657,no,yes,25,265.100000,110,45.070000,...,99,16.780000,244.700000,91,11.010000,10.000000,3,2.700000,1,False.
1,OH,107,415,371-7191,no,yes,26,161.600000,123,27.470000,...,103,16.620000,254.400000,103,11.450000,13.700000,3,3.700000,1,False.
2,NJ,137,415,358-1921,no,no,0,243.400000,114,41.380000,...,110,10.300000,162.600000,104,7.320000,12.200000,5,3.290000,0,False.
3,OH,84,408,375-9999,yes,no,0,299.400000,71,50.900000,...,88,5.260000,196.900000,89,8.860000,6.600000,7,1.780000,2,False.
4,OK,75,415,330-6626,yes,no,0,166.700000,113,28.340000,...,122,12.610000,186.900000,121,8.410000,10.100000,3,2.730000,3,False.

## lectura y escritura de ficheros con python :whale:

In [18]:
infile = mainpath + "/" + "customer-churn-model/Customer Churn Model.txt"
outfile = mainpath + "/" + "customer-churn-model/tab Customer Churn Model.txt"
infile

'/home/lexus72/github/python-ml-course/datasets/customer-churn-model/Customer Churn Model.txt'

In [19]:
with open(infile, "r") as infile1:
    with open(outfile, "w") as outfile1:
        for line in infile1:
            fields = line.strip().split(",")
            outfile1.write("\t".join(fields))
            outfile1.write("\n")

In [20]:
df4 = pd.read_csv(outfile, sep="\t")
df4

,State,Account Length,Area Code,Phone,Int'l Plan,VMail Plan,VMail Message,Day Mins,Day Calls,Day Charge,...,Eve Calls,Eve Charge,Night Mins,Night Calls,Night Charge,Intl Mins,Intl Calls,Intl Charge,CustServ Calls,Churn?
0,KS,128,415,382-4657,no,yes,25,265.1,110,45.07,...,99,16.78,244.7,91,11.01,10.0,3,2.70,1,False.
1,OH,107,415,371-7191,no,yes,26,161.6,123,27.47,...,103,16.62,254.4,103,11.45,13.7,3,3.70,1,False.
2,NJ,137,415,358-1921,no,no,0,243.4,114,41.38,...,110,10.30,162.6,104,7.32,12.2,5,3.29,0,False.
3,OH,84,408,375-9999,yes,no,0,299.4,71,50.90,...,88,5.26,196.9,89,8.86,6.6,7,1.78,2,False.
4,OK,75,415,330-6626,yes,no,0,166.7,113,28.34,...,122,12.61,186.9,121,8.41,10.1,3,2.73,3,False.
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3328,AZ,192,415,414-4276,no,yes,36,156.2,77,26.55,...,126,18.32,279.1,83,12.56,9.9,6,2.67,2,False.
3329,WV,68,415,370-3271,no,no,0,231.1,57,39.29,...,55,13.04,191.3,123,8.61,9.6,4,2.59,3,False.
3330,RI,28,510,328-8230,no,no,0,180.8,109,30.74,...,58,24.55,191.9,91,8.64,14.1,6,3.81,2,False.
3331,CT,184,510,364-6381,yes,no,0,213.8,105,36.35,...,84,13.57,139.2,137,6.26,5.0,10,1.35,2,False.
3332,TN,74,415,400-4344,no,yes,25,234.4,113,39.85,...,82,22.60,241.4,77,10.86,13.7,4,3.70,0,False.

## leer datos desde una URL

In [33]:
medals_url = "http://winterolympicsmedals.com/medals.csv"
medals_data = pd.read_csv(medals_url)
medals_data.head()

,Year,City,Sport,Discipline,NOC,Event,Event gender,Medal
0,1924,Chamonix,Skating,Figure skating,AUT,individual,M,Silver
1,1924,Chamonix,Skating,Figure skating,AUT,individual,W,Gold
2,1924,Chamonix,Skating,Figure skating,AUT,pairs,X,Gold
3,1924,Chamonix,Bobsleigh,Bobsleigh,BEL,four-man,M,Bronze
4,1924,Chamonix,Ice Hockey,Ice Hockey,CAN,ice hockey,M,Gold

## importar y usar librerias csv y urllib3

In [24]:
import csv
import urllib3

In [25]:
import urllib3
http = urllib3.PoolManager()
r = http.request('GET', medals_url)
r.status
response = r.data
response

,5000m,M,Gold\n2002,Salt Lake City,Skating,Speed skating,NED,5000m,W,Silver\n2002,Salt Lake City,Biathlon,Biathlon,NOR,10km,M,Gold\n2002,Salt Lake City,Biathlon,Biathlon,NOR,12.5km pursuit,M,Gold\n2002,Salt Lake City,Biathlon,Biathlon,NOR,15km,W,Silver\n2002,Salt Lake City,Biathlon,Biathlon,NOR,20km,M,Gold\n2002,Salt Lake City,Biathlon,Biathlon,NOR,4x7.5km relay,M,Gold\n2002,Salt Lake City,Biathlon,Biathlon,NOR,4x7.5km relay,W,Silver\n2002,Salt Lake City,Curling,Curling,NOR,curling,M,Gold\n2002,Salt Lake City,Skating,Speed skating,NOR,10000m,M,Bronze\n2002,Salt Lake City,Skating,Speed skating,NOR,1500m,M,Bronze\n2002,Salt Lake City,Skiing,Alpine Skiing,NOR,alpine combined,M,Gold\n2002,Salt Lake City,Skiing,Alpine Skiing,NOR,downhill,M,Silver\n2002,Salt Lake City,Skiing,Alpine Skiing,NOR,giant slalom,M,Bronze\n2002,Salt Lake City,Skiing,Alpine Skiing,NOR,super-G,M,Gold\n2002,Salt Lake City,Skiing,Cross Country S,NOR,10km,W,Gold\n2002,Salt Lake City,Skiing,Cross Country S,NOR,10km pursuit,M,Gold\n2002,Salt Lake City,Skiing,Cross Country S,NOR,10km pursuit,M,Gold\n2002,Salt Lake City,Skiing,Cross Country S,NOR,15km,M,Silver\n2002,Salt Lake City,Skiing,Cross Country S,NOR,30km,W,Bronze\n2002,Salt Lake City,Skiing,Cross Country S,NOR,30km mass start,M,Bronze\n2002,Salt Lake City,Skiing,Cross Country S,NOR,4x10km relay,M,Gold\n2002,Salt Lake City,Skiing,Cross Country S,NOR,4x5km relay,W,Silver\n2002,Salt Lake City,Skiing,Cross Country S,NOR,50km,M,Bronze\n2002,Salt Lake City,Skiing,Cross Country S,NOR,Sprint 1.5km,M,Gold\n2002,Salt Lake City,Skiing,Cross Country S,NOR,Sprint 1.5km,W,Bronze\n2002,Salt Lake City,Skiing,Freestyle Ski.,NOR,moguls,W,Gold\n2002,Salt Lake City,Skiing,Ski Jumping,POL,K120 individual (90m),M,Silver\n2002,Salt Lake City,Skiing,Ski Jumping,POL,K90 individual (70m),M,Bronze\n2002,Salt Lake City,Biathlon,Biathlon,RUS,10km pursuit,W,Gold\n2002,Salt Lake City,Biathlon,Biathlon,RUS,20km,M,Bronze\n2002,Salt Lake City,Biathlon,Biathlon,RUS,4x7.5km relay,W,Bronze\n2002,Salt Lake City,Ice Hockey,Ice Hockey,RUS,ice hockey,M,Bronze\n2002,Salt Lake City,Skating,Figure skating,RUS,ice dancing,X,Silver\n2002,Salt Lake City,Skating,Figure skating,RUS,individual,M,Gold\n2002,Salt Lake City,Skating,Figure skating,RUS,individual,M,Silver\n2002,Salt Lake City,Skating,Figure skating,RUS,individual,W,Silver\n2002,Salt Lake City,Skating,Figure skating,RUS,pairs,X,Gold\n2002,Salt Lake City,Skiing,Cross Country S,RUS,10km,W,Silver\n2002,Salt Lake City,Skiing,Cross Country S,RUS,15km mass start,W,Bronze\n2002,Salt Lake City,Skiing,Cross Country S,RUS,50km,M,Gold\n2002,Salt Lake City,Skiing,Cross Country S,RUS,sprint 1.5km,W,Gold\n2002,Salt Lake City,Skiing,Ski Jumping,SLO,K120 team (90m),M,Bronze\n2002,Salt Lake City,Bobsleigh,Bobsleigh,SUI,two-man,M,Bronze\n2002,Salt Lake City,Bobsleigh,Bobsleigh,SUI,two-man,M,Silver\n2002,Salt Lake City,Bobsleigh,Skeleton,SUI,individual,M,Bronze\n2002,Salt Lake City,Curling,Curling,SUI,curling,M,Bronze\n2002,Salt Lake City,Curling,Curling,SUI,curling,W,Silver\n2002,Salt Lake City,Skiing,Alpine Skiing,SUI,giant slalom,W,Bronze\n2002,Salt Lake City,Skiing,Cross Country S,SUI,4x5km relay,W,Bronze\n2002,Salt Lake City,Skiing,Ski Jumping,SUI,K120 individual (90m),M,Gold\n2002,Salt Lake City,Skiing,Ski Jumping,SUI,K90 individual (70m),M,Gold\n2002,Salt Lake City,Skiing,Snowboard,SUI,Giant parallel slalom,M,Gold\n2002,Salt Lake City,Skiing,Snowboard,SUI,Half-pipe,W,Bronze\n2002,Salt Lake City,Biathlon,Biathlon,SWE,15km,W,Bronze\n2002,Salt Lake City,Biathlon,Biathlon,SWE,7.5km,W,Bronze\n2002,Salt Lake City,Ice Hockey,Ice Hockey,SWE,ice hockey,W,Bronze\n2002,Salt Lake City,Skiing,Alpine Skiing,SWE,giant slalom,W,Silver\n2002,Salt Lake City,Skiing,Alpine Skiing,SWE,slalom,W,Bronze\n2002,Salt Lake City,Skiing,Cross Country S,SWE,10km pursuit,M,Bronze\n2002,Salt Lake City,Skiing,Snowboard,SWE,Giant parallel slalom,M,Silver\n2002,Salt Lake City,Bobsleigh,Bobsleigh,USA,four-man,M,Bronze\n2002,Salt Lake City,Bobsleigh,Bobsleigh,USA,four-man,M,Silver\n2002,Salt Lake City,Bobsleigh,Bobsleigh,USA,two-man,W,Gold\n2002,Salt Lake City,Bobsleigh,Skeleton,USA,individual,M,Gold\n2002,Salt Lake City,Bobsleigh,Skeleton,USA,individual,W,Gold\n2002,Salt Lake City,Bobsleigh,Skeleton,USA,individual,W,Silver\n2002,Salt Lake City,Ice Hockey,Ice Hockey,USA,ice hockey,M,Silver\n2002,Salt Lake City,Ice Hockey,Ice Hockey,USA,ice hockey,W,Silver\n2002,Salt Lake City,Luge,Luge,USA,doubles,X,Bronze\n2002,Salt Lake City,Luge,Luge,USA,doubles,X,Silver\n2002,Salt Lake City,Skating,Figure skating,USA,individual,M,Bronze\n2002,Salt Lake City,Skating,Figure skating,USA,individual,W,Bronze\n2002,Salt Lake City,Skating,Figure skating,USA,individual,W,Gold\n2002,Salt Lake City,Skating,Short Track S.,USA,1000m,M,Silver\n2002,Salt Lake City,Skating,Short Track S.,USA,1500m,M,Gold\n2002,Salt Lake City,Skating,Short Track S.,USA,500m,M,Bronze\n2002,Salt Lake City,Skating,Speed skating,USA,1000m,M,Bronze\n2002,Salt Lake City,Skating,Speed skating,USA,1000m,W,Bronze\n2002,Salt Lake City,Skating,Speed skating,USA,1000m,W,Gold\n2002,Salt Lake City,Skating,Speed skating,USA,1500m,M,Gold\n2002,Salt Lake City,Skating,Speed skating,USA,1500m,W,Bronze\n2002,Salt Lake City,Skating,Speed skating,USA,5000m,M,Silver\n2002,Salt Lake City,Skating,Speed skating,USA,500m,M,Bronze\n2002,Salt Lake City,Skating,Speed skating,USA,500m,M,Gold\n2002,Salt Lake City,Skiing,Alpine Skiing,USA,alpine combined,M,Silver\n2002,Salt Lake City,Skiing,Alpine Skiing,USA,giant slalom,M,Silver\n2002,Salt Lake City,Skiing,Freestyle Ski.,USA,aerials,M,Silver\n2002,Salt Lake City,Skiing,Freestyle Ski.,USA,moguls,M,Silver\n2002,Salt Lake City,Skiing,Freestyle Ski.,USA,moguls,W,Silver\n2002,Salt Lake City,Skiing,Snowboard,USA,Giant parallel slalom,M,Bronze\n2002,Salt Lake City,Skiing,Snowboard,USA,Half-pipe,M,Bronze\n2002,Salt Lake City,Skiing,Snowboard,USA,Half-pipe,M,Gold\n2002,Salt Lake City,Skiing,Snowboard,USA,Half-pipe,M,Silver\n2002,Salt Lake City,Skiing,Snowboard,USA,Half-pipe,W,Gold\n2006,Turin,Skiing,Freestyle Ski.,AUS,aerials,W,Bronze\n2006,Turin,Skiing,Freestyle Ski.,AUS,moguls,M,Gold\n2006,Turin,Luge,Luge,AUT,doubles,X,Gold\n2006,Turin,Skiing,Alpine Skiing,AUT,Alpine combined,M,Bronze\n2006,Turin,Skiing,Alpine Skiing,AUT,Alpine combined,W,Silver\n2006,Turin,Skiing,Alpine Skiing,AUT,downhill,M,Silver\n2006,Turin,Skiing,Alpine Skiing,AUT,downhill,W,Gold\n2006,Turin,Skiing,Alpine Skiing,AUT,giant slalom,M,Bronze\n2006,Turin,Skiing,Alpine Skiing,AUT,giant slalom,M,Gold\n2006,Turin,Skiing,Alpine Skiing,AUT,slalom,M,Bronze\n2006,Turin,Skiing,Alpine Skiing,AUT,slalom,M,Gold\n2006,Turin,Skiing,Alpine Skiing,AUT,slalom,M,Silver\n2006,Turin,Skiing,Alpine Skiing,AUT,slalom,W,Bronze\n2006,Turin,Skiing,Alpine Skiing,AUT,slalom,W,Silver\n2006,Turin,Skiing,Alpine Skiing,AUT,super-G,M,Silver\n2006,Turin,Skiing,Alpine Skiing,AUT,super-G,W,Bronze\n2006,Turin,Skiing,Alpine Skiing,AUT,super-G,W,Gold\n2006,Turin,Skiing,Cross Country S,AUT,50km,M,Bronze\n2006,Turin,Skiing,Nordic Combined,AUT,Individual,M,Silver\n2006,Turin,Skiing,Nordic Combined,AUT,Individual sprint,M,Gold\n2006,Turin,Skiing,Nordic Combined,AUT,Team,M,Gold\n2006,Turin,Skiing,Ski Jumping,AUT,K120 individual (90m),M,Gold\n2006,Turin,Skiing,Ski Jumping,AUT,K120 individual (90m),M,Silver\n2006,Turin,Skiing,Ski Jumping,AUT,K120 team (90m),M,Gold\n2006,Turin,Skiing,Snowboard,AUT,Giant parallel slalom,M,Bronze\n2006,Turin,Skiing,Freestyle Ski.,BLR,aerials,M,Silver\n2006,Turin,Skating,Short Track S.,BUL,500m,W,Silver\n2006,Turin,Bobsleigh,Bobsleigh,CAN,two-man,M,Silver\n2006,Turin,Bobsleigh,Skeleton,CAN,individual,M,Gold\n2006,Turin,Bobsleigh,Skeleton,CAN,individual,M,Silver\n2006,Turin,Bobsleigh,Skeleton,CAN,individual,W,Bronze\n2006,Turin,Curling,Curling,CAN,curling,M,Gold\n2006,Turin,Curling,Curling,CAN,curling,W,Bronze\n2006,Turin,Ice Hockey,Ice Hockey,CAN,ice hockey,W,Gold\n2006,Turin,Skating,Figure skating,CAN,individual,M,Bronze\n2006,Turin,Skating,Short Track S.,CAN,3000m relay,W,Silver\n2006,Turin,Skating,Short Track S.,CAN,5000m relay,M,Silver\n2006,Turin,Skating,Short Track S.,CAN,500m,M,Silver\n2006,Turin,Skating,Short Track S.,CAN,500m,W,Bronze\n2006,Turin,Skating,Speed skating,CAN,1000m,W,Silver\n2006,Turin,Skating,Speed skating,CAN,1500m,W,Gold\n2006,Turin,Skating,Speed skating,CAN,1500m,W,Silver\n2006,Turin,Skating,Speed skating,CAN,3000m,W,Bronze\n2006,Turin,Skating,Speed skating,CAN,5000m,W,Bronze\n2006,Turin,Skating,Speed skating,CAN,5000m,W,Gold\n2006,Turin,Skating,Speed skating,CAN,Team pursuit,M,Silver\n2006,Turin,Skating,Speed skating,CAN,Team pursuit,W,Silver\n2006,Turin,Skiing,Cross Country S,CAN,Sprint 1.5km,W,Gold\n2006,Turin,Skiing,Cross Country S,CAN,Team sprint,W,Silver\n2006,Turin,Skiing,Freestyle Ski.,CAN,moguls,W,Gold\n2006,Turin,Skiing,Snowboard,CAN,Snowboard Cross,W,Bronze\n2006,Turin,Skating,Figure skating,CHN,pairs,X,Bronze\n2006,Turin,Skating,Figure skating,CHN,pairs,X,Silver\n2006,Turin,Skating,Short Track S.,CHN,1000m,W,Bronze\n2006,Turin,Skating,Short Track S.,CHN,1000m,W,Silver\n2006,Turin,Skating,Short Track S.,CHN,1500m,M,Bronze\n2006,Turin,Skating,Short Track S.,CHN,1500m,W,Bronze\n2006,Turin,Skating,Short Track S.,CHN,500m,W,Gold\n2006,Turin,Skating,Speed skating,CHN,500m,W,Bronze\n2006,Turin,Skating,Speed skating,CHN,500m,W,Silver\n2006,Turin,Skiing,Freestyle Ski.,CHN,aerials,M,Gold\n2006,Turin,Skiing,Freestyle Ski.,CHN,aerials,W,Silver\n2006,Turin,Skiing,Alpine Skiing,CRO,Alpine combined,M,Silver\n2006,Turin,Skiing,Alpine Skiing,CRO,Alpine combined,W,Gold\n2006,Turin,Skiing,Alpine Skiing,CRO,super-G,W,Silver\n2006,Turin,Ice Hockey,Ice Hockey,CZE,ice hockey,M,Bronze\n2006,Turin,Skiing,Cross Country S,CZE,15km,M,Silver\n2006,Turin,Skiing,Cross Country S,CZE,30km,W,Gold\n2006,Turin,Skiing,Cross Country S,CZE,Combined 7.5 + 7.5km mass start,W,Silver\n2006,Turin,Skiing,Cross Country S,EST,10km,W,Gold\n2006,Turin,Skiing,Cross Country S,EST,15km,M,Gold\n2006,Turin,Skiing,Cross Country S,EST,Combined 7.5 + 7.5km mass start,W,Gold\n2006,Turin,Curling,Curling,FIN,curling,M,Silver\n2006,Turin,Ice Hockey,Ice Hockey,FIN,ice hockey,M,Silver\n2006,Turin,Skiing,Alpine Skiing,FIN,giant slalom,W,Silver\n2006,Turin,Skiing,Cross Country S,FIN,Team sprint,W,Bronze\n2006,Turin,Skiing,Freestyle Ski.,FIN,moguls,M,Silver\n2006,Turin,Skiing,Nordic Combined,FIN,Team,M,Bronze\n2006,Turin,Skiing,Ski Jumping,FIN,K120 team (90m),M,Silver\n2006,Turin,Skiing,Ski Jumping,FIN,K90 individual (70m),M,Silver\n2006,Turin,Skiing,Snowboard,FIN,Half-pipe,M,Bronze\n2006,Turin,Biathlon,Biathlon,FRA,12.5km pursuit,M,Gold\n2006,Turin,Biathlon,Biathlon,FRA,4x6km relay,W,Bronze\n2006,Turin,Biathlon,Biathlon,FRA,4x7.5km relay,M,Bronze\n2006,Turin,Biathlon,Biathlon,FRA,7.5km,W,Gold\n2006,Turin,Skiing,Alpine Skiing,FRA,downhill,M,Gold\n2006,Turin,Skiing,Alpine Skiing,FRA,giant slalom,M,Silver\n2006,Turin,Skiing,Cross Country S,FRA,Sprint 1.5km,M,Silver\n2006,Turin,Skiing,Freestyle Ski.,FRA,moguls,W,Bronze\n2006,Turin,Skiing,Snowboard,FRA,Snowboard Cross,M,Bronze\n2006,Turin,Bobsleigh,Skeleton,GBR,individual,W,Silver\n2006,Turin,Biathlon,Biathlon,GER,10km,M,Gold\n2006,Turin,Biathlon,Biathlon,GER,10km pursuit,W,Gold\n2006,Turin,Biathlon,Biathlon,GER,10km pursuit,W,Silver\n2006,Turin,Biathlon,Biathlon,GER,12.5km mass start,W,Bronze\n2006,Turin,Biathlon,Biathlon,GER,12.5km mass start,W,Silver\n2006,Turin,Biathlon,Biathlon,GER,12.5km pursuit,M,Bronze\n2006,Turin,Biathlon,Biathlon,GER,15km,W,Silver\n2006,Turin,Biathlon,Biathlon,GER,15km mass start,M,Gold\n2006,Turin,Biathlon,Biathlon,GER,20km,M,Gold\n2006,Turin,Biathlon,Biathlon,GER,4x6km relay,W,Silver\n2006,Turin,Biathlon,Biathlon,GER,4x7.5km relay,M,Gold\n2006,Turin,Bobsleigh,Bobsleigh,GER,four-man,M,Gold\n2006,Turin,Bobsleigh,Bobsleigh,GER,two-man,M,Gold\n2006,Turin,Bobsleigh,Bobsleigh,GER,two-man,W,Gold\n2006,Turin,Luge,Luge,GER,doubles,X,Silver\n2006,Turin,Luge,Luge,GER,singles,W,Bronze\n2006,Turin,Luge,Luge,GER,singles,W,Gold\n2006,Turin,Luge,Luge,GER,singles,W,Silver\n2006,Turin,Skating,Speed skating,GER,1000m,W,Bronze\n2006,Turin,Skating,Speed skating,GER,5000m,W,Silver\n2006,Turin,Skating,Speed skating,GER,Team pursuit,W,Gold\n2006,Turin,Skiing,Cross Country S,GER,15km,M,Bronze\n2006,Turin,Skiing,Cross Country S,GER,4x10km relay,M,Silver\n2006,Turin,Skiing,Cross Country S,GER,4x5km relay,W,Silver\n2006,Turin,Skiing,Cross Country S,GER,sprint 1.5km,W,Silver\n2006,Turin,Skiing,Nordic Combined,GER,Individual,M,Gold\n2006,Turin,Skiing,Nordic Combined,GER,Individual sprint,M,Bronze\n2006,Turin,Skiing,Nordic Combined,GER,Team,M,Silver\n2006,Turin,Skiing,Snowboard,GER,Giant parallel slalom,W,Silver\n2006,Turin,Bobsleigh,Bobsleigh,ITA,two-man,W,Bronze\n2006,Turin,Luge,Luge,ITA,doubles,X,Bronze\n2006,Turin,Luge,Luge,ITA,singles,M,Gold\n2006,Turin,Skating,Short Track S.,ITA,3000m relay,W,Bronze\n2006,Turin,Skating,Speed skating,ITA,1500m,M,Gold\n2006,Turin,Skating,Speed skating,ITA,5000m,M,Bronze\n2006,Turin,Skating,Speed skating,ITA,Team pursuit,M,Gold\n2006,Turin,Skiing,Cross Country S,ITA,4x10km relay,M,Gold\n2006,Turin,Skiing,Cross Country S,ITA,4x5km relay,W,Bronze\n2006,Turin,Skiing,Cross Country S,ITA,50km,M,Gold\n2006,Turin,Skiing,Cross Country S,ITA,Combined 15 + 15km mass start,M,Bronze\n2006,Turin,Skating,Figure skating,JPN,individual,W,Gold\n2006,Turin,Skating,Short Track S.,KOR,1000m,M,Gold\n2006,Turin,Skating,Short Track S.,KOR,1000m,M,Silver\n2006,Turin,Skating,Short Track S.,KOR,1000m,W,Gold\n2006,Turin,Skating,Short Track S.,KOR,1500m,M,Gold\n2006,Turin,Skating,Short Track S.,KOR,1500m,M,Silver\n2006,Turin,Skating,Short Track S.,KOR,1500m,W,Gold\n2006,Turin,Skating,Short Track S.,KOR,1500m,W,Silver\n2006,Turin,Skating,Short Track S.,KOR,3000m relay,W,Gold\n2006,Turin,Skating,Short Track S.,KOR,5000m relay,M,Gold\n2006,Turin,Skating,Short Track S.,KOR,500m,M,Bronze\n2006,Turin,Skating,Speed skating,KOR,500m,M,Bronze\n2006,Turin,Luge,Luge,LAT,singles,M,Bronze\n2006,Turin,Skating,Speed skating,NED,10000m,M,Bronze\n2006,Turin,Skating,Speed skating,NED,10000m,M,Gold\n2006,Turin,Skating,Speed skating,NED,1000m,M,Bronze\n2006,Turin,Skating,Speed skating,NED,1000m,W,Gold\n2006,Turin,Skating,Speed skating,NED,1500m,W,Bronze\n2006,Turin,Skating,Speed skating,NED,3000m,W,Gold\n2006,Turin,Skating,Speed skating,NED,3000m,W,Silver\n2006,Turin,Skating,Speed skating,NED,5000m,M,Silver\n2006,Turin,Skating,Speed skating,NED,Team pursuit,M,Bronze\n2006,Turin,Biathlon,Biathlon,NOR,10km,M,Bronze\n2006,Turin,Biathlon,Biathlon,NOR,10km,M,Silver\n2006,Turin,Biathlon,Biathlon,NOR,12.5km pursuit,M,Silver\n2006,Turin,Biathlon,Biathlon,NOR,15km mass start,M,Bronze\n2006,Turin,Biathlon,Biathlon,NOR,20km,M,Bronze\n2006,Turin,Biathlon,Biathlon,NOR,20km,M,Silver\n2006,Turin,Skiing,Alpine Skiing,NOR,super-G,M,Gold\n2006,Turin,Skiing,Cross Country S,NOR,10km,W,Bronze\n2006,Turin,Skiing,Cross Country S,NOR,10km,W,Silver\n2006,Turin,Skiing,Cross Country S,NOR,Combined 15 + 15km mass start,M,Silver\n2006,Turin,Skiing,Cross Country S,NOR,Team sprint,M,Silver\n2006,Turin,Skiing,Freestyle Ski.,NOR,moguls,W,Silver\n2006,Turin,Skiing,Nordic Combined,NOR,Individual,M,Bronze\n2006,Turin,Skiing,Nordic Combined,NOR,Individual sprint,M,Silver\n2006,Turin,Skiing,Ski Jumping,NOR,K120 individual (90m),M,Bronze\n2006,Turin,Skiing,Ski Jumping,NOR,K120 team (90m),M,Bronze\n2006,Turin,Skiing,Ski Jumping,NOR,K90 individual (70m),M,Bronze\n2006,Turin,Skiing,Ski Jumping,NOR,K90 individual (70m),M,Gold\n2006,Turin,Skiing,Snowboard,NOR,Half-pipe,W,Bronze\n2006,Turin,Biathlon,Biathlon,POL,15km mass start,M,Silver\n2006,Turin,Skiing,Cross Country S,POL,30km,W,Bronze\n2006,Turin,Biathlon,Biathlon,RUS,10km pursuit,W,Bronze\n2006,Turin,Biathlon,Biathlon,RUS,15km,W,Bronze\n2006,Turin,Biathlon,Biathlon,RUS,15km,W,Gold\n2006,Turin,Biathlon,Biathlon,RUS,4x6km relay,W,Gold\n2006,Turin,Biathlon,Biathlon,RUS,4x7.5km relay,M,Silver\n2006,Turin,Bobsleigh,Bobsleigh,RUS,four-man,M,Silver\n2006,Turin,Luge,Luge,RUS,singles,M,Silver\n2006,Turin,Skating,Figure skating,RUS,ice dancing,X,Gold\n2006,Turin,Skating,Figure skating,RUS,individual,M,Gold\n2006,Turin,Skating,Figure skating,RUS,individual,W,Bronze\n2006,Turin,Skating,Figure skating,RUS,pairs,X,Gold\n2006,Turin,Skating,Speed skating,RUS,500m,M,Silver\n2006,Turin,Skating,Speed skating,RUS,500m,W,Gold\n2006,Turin,Skating,Speed skating,RUS,Team pursuit,W,Bronze\n2006,Turin,Skiing,Cross Country S,RUS,30km,W,Silver\n2006,Turin,Skiing,Cross Country S,RUS,4x5km relay,W,Gold\n2006,Turin,Skiing,Cross Country S,RUS,50km,M,Silver\n2006,Turin,Skiing,Cross Country S,RUS,Combined 15 + 15km mass start,M,Gold\n2006,Turin,Skiing,Cross Country S,RUS,Combined 7.5 + 7.5km mass start,W,Bronze\n2006,Turin,Skiing,Cross Country S,RUS,sprint 1.5km,W,Bronze\n2006,Turin,Skiing,Cross Country S,RUS,Team sprint,M,Bronze\n2006,Turin,Skiing,Freestyle Ski.,RUS,aerials,M,Bronze\n2006,Turin,Bobsleigh,Bobsleigh,SUI,four-man,M,Bronze\n2006,Turin,Bobsleigh,Bobsleigh,SUI,two-man,M,Bronze\n2006,Turin,Bobsleigh,Skeleton,SUI,individual,M,Bronze\n2006,Turin,Bobsleigh,Skeleton,SUI,individual,W,Gold\n2006,Turin,Curling,Curling,SUI,curling,W,Silver\n2006,Turin,Skating,Figure skating,SUI,individual,M,Silver\n2006,Turin,Skiing,Alpine Skiing,SUI,downhill,M,Bronze\n2006,Turin,Skiing,Alpine Skiing,SUI,downhill,W,Silver\n2006,Turin,Skiing,Alpine Skiing,SUI,super-G,M,Bronze\n2006,Turin,Skiing,Freestyle Ski.,SUI,aerials,W,Gold\n2006,Turin,Skiing,Snowboard,SUI,Giant parallel slalom,M,Gold\n2006,Turin,Skiing,Snowboard,SUI,Giant parallel slalom,M,Silver\n2006,Turin,Skiing,Snowboard,SUI,Giant parallel slalom,W,Gold\n2006,Turin,Skiing,Snowboard,SUI,Snowboard Cross,W,Gold\n2006,Turin,Skiing,Snowboard,SVK,Snowboard Cross,M,Silver\n2006,Turin,Biathlon,Biathlon,SWE,12.5km mass start,W,Gold\n2006,Turin,Biathlon,Biathlon,SWE,7.5km,W,Silver\n2006,Turin,Curling,Curling,SWE,curling,W,Gold\n2006,Turin,Ice Hockey,Ice Hockey,SWE,ice hockey,M,Gold\n2006,Turin,Ice Hockey,Ice Hockey,SWE,ice hockey,W,Silver\n2006,Turin,Skiing,Alpine Skiing,SWE,Alpine combined,W,Bronze\n2006,Turin,Skiing,Alpine Skiing,SWE,downhill,W,Bronze\n2006,Turin,Skiing,Alpine Skiing,SWE,giant slalom,W,Bronze\n2006,Turin,Skiing,Alpine Skiing,SWE,slalom,W,Gold\n2006,Turin,Skiing,Cross Country S,SWE,4x10km relay,M,Bronze\n2006,Turin,Skiing,Cross Country S,SWE,Sprint 1.5km,M,Bronze\n2006,Turin,Skiing,Cross Country S,SWE,Sprint 1.5km,M,Gold\n2006,Turin,Skiing,Cross Country S,SWE,Team sprint,M,Gold\n2006,Turin,Skiing,Cross Country S,SWE,Team sprint,W,Gold\n2006,Turin,Biathlon,Biathlon,UKR,7.5km,W,Bronze\n2006,Turin,Skating,Figure skating,UKR,ice dancing,X,Bronze\n2006,Turin,Bobsleigh,Bobsleigh,USA,two-man,W,Silver\n2006,Turin,Curling,Curling,USA,curling,M,Bronze\n2006,Turin,Ice Hockey,Ice Hockey,USA,ice hockey,W,Bronze\n2006,Turin,Skating,Figure skating,USA,ice dancing,X,Silver\n2006,Turin,Skating,Figure skating,USA,individual,W,Silver\n2006,Turin,Skating,Short Track S.,USA,1000m,M,Bronze\n2006,Turin,Skating,Short Track S.,USA,5000m relay,M,Bronze\n2006,Turin,Skating,Short Track S.,USA,500m,M,Gold\n2006,Turin,Skating,Speed skating,USA,10000m,M,Silver\n2006,Turin,Skating,Speed skating,USA,1000m,M,Gold\n2006,Turin,Skating,Speed skating,USA,1000m,M,Silver\n2006,Turin,Skating,Speed skating,USA,1500m,M,Bronze\n2006,Turin,Skating,Speed skating,USA,1500m,M,Silver\n2006,Turin,Skating,Speed skating,USA,5000m,M,Gold\n2006,Turin,Skating,Speed skating,USA,500m,M,Gold\n2006,Turin,Skiing,Alpine Skiing,USA,Alpine combined,M,Gold\n2006,Turin,Skiing,Alpine Skiing,USA,giant slalom,W,Gold\n2006,Turin,Skiing,Freestyle Ski.,USA,moguls,M,Bronze\n2006,Turin,Skiing,Snowboard,USA,Giant parallel slalom,W,Bronze\n2006,Turin,Skiing,Snowboard,USA,Half-pipe,M,Gold\n2006,Turin,Skiing,Snowboard,USA,Half-pipe,M,Silver\n2006,Turin,Skiing,Snowboard,USA,Half-pipe,W,Gold\n2006,Turin,Skiing,Snowboard,USA,Half-pipe,W,Silver\n2006,Turin,Skiing,Snowboard,USA,Snowboard Cross,M,Gold\n2006,Turin,Skiing,Snowboard,USA,Snowboard Cross,W,Silver"

In [26]:
cr = csv.reader(response)
cr

## ficheros xls y xlsx

In [27]:
mainpath = "/home/lexus72/github/python-ml-course/datasets"
filename = "titanic/titanic3.xls"

In [28]:
titanic2 = pd.read_excel(mainpath + "/" + filename, "titanic3")

In [29]:
titanic2

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [30]:
type(titanic2)

pandas.core.frame.DataFrame

In [31]:
titanic2_json = titanic2.to_json(mainpath + "/" + "/titanic/titanic.json")

In [32]:
titanic2_json

##  29. ejercicio descargar y procesar datos desde una URL

In [23]:
# importamos libreria y hacemos conexion web con los datos
import urllib3
http = urllib3.PoolManager()
r = http.request('GET', medals_url)
r.status
response = r.data

In [24]:
# el objeto response es tipo string binario, lo pasamos a string normal decodificandolo con utf-8
str_data = response.decode('utf-8')

In [25]:
# dividimos el string en un array de filas separandolo por \n
lines = str_data.split('\n')

In [26]:
# la primera linea tiene la cabecera, asi que la extraemos
col_names = lines[0].split(',')
n_cols = len(col_names)

In [27]:
# generamos un diccionario vacio donde ira la informacion extraida o procesada de la url externa
counter = 0
main_dict = {}
for col in col_names:
    main_dict[col] = []

In [29]:
# procesamos fila a fila la informacion para ir rellenando el diccionario con los datos
for line in lines:
    # nos saltamos la primera linea q es la q contiene la cabecera y ya tenemos procesada
    if (counter > 0):
        # dividimos cada string por las ',' como elemento separador
        values = line.strip().split(',')
        # añadimos cada valor a su respectiva columna del dicconario
        for i in range(len(col_names)):
            main_dict[col_names[i]].append(values[i])
    counter = counter + 1
print("el data set tiene %d filas y %d columnas"%(counter, n_cols))

el data set tiene 2312 filas y 8 columnas

In [30]:
# convertimos el diccionario a dataframe
medals_df = pd.DataFrame(main_dict)
medals_df.head()

,Year,City,Sport,Discipline,NOC,Event,Event gender,Medal
0,1924,Chamonix,Skating,Figure skating,AUT,individual,M,Silver
1,1924,Chamonix,Skating,Figure skating,AUT,individual,W,Gold
2,1924,Chamonix,Skating,Figure skating,AUT,pairs,X,Gold
3,1924,Chamonix,Bobsleigh,Bobsleigh,BEL,four-man,M,Bronze
4,1924,Chamonix,Ice Hockey,Ice Hockey,CAN,ice hockey,M,Gold

In [31]:
# elegimos donde guardarlo, por el contexto deberia ser en  athletes
mainpath = "/home/lexus72/github/python-ml-course/datasets"
filename = "athletes/downloaded_medals."
fullpath = os.path.join(mainpath, filename)

In [32]:
# lo guardamos en json excel csv, segun queramos
medals_df.to_csv(fullpath + "csv")
medals_df.to_json(fullpath + "json")
medals_df.to_excel(fullpath + "xls")

<ipython-input-32-b8e9a82fb40b>:4: FutureWarning: As the xlwt package is no longer maintained, the xlwt engine will be removed in a future version of pandas. This is the only engine in pandas that supports writing in the xls format. Install openpyxl and write to an xlsx file instead. You can set the option io.excel.xls.writer to 'xlwt' to silence this warning. While this option is deprecated and will also raise a warning, it can be globally set and the warning suppressed.
  medals_df.to_excel(fullpath + "xls")

## crear una funcion generica con el ejercicio 29

In [54]:
def downloadfromurl(url, filename):
    import urllib3
    http = urllib3.PoolManager()
    r = http.request('GET', url)
    r.status
    response = r.data
    str_data = response.decode('utf-8')
    lines = str_data.split('\n')
    col_names = lines[0].split(',')
    n_cols = len(col_names)
    counter = 0
    main_dict = {}
    for col in col_names:
        main_dict[col] = []
    for line in lines:
        if (counter > 0):
            values = line.strip().split(',')
            for i in range(len(col_names)):
                main_dict[col_names[i]].append(values[i])
        counter = counter + 1
    print("el data set tiene %d filas y %d columnas"%(counter, n_cols))
    df = pd.DataFrame(main_dict)
    df.head()
    print(df.head())
    mainpath = "/home/lexus72/github/python-ml-course/datasets"
    #filename = "athletes/downloaded_medals"
    fullpath = os.path.join(mainpath, filename)
    df.to_csv(fullpath + ".csv")
    df.to_json(fullpath + ".json")
    df.to_excel(fullpath + ".xls")
    print("los archivos se guardaron en: " +fullpath)
    return df

## ejecutando funcion downloadfromurl()

In [55]:
medals_df = downloadfromurl(medals_url, "athletes/medals")
medals_df.head()
print(medals_df)

el data set tiene 2312 filas y 8 columnas
   Year      City       Sport      Discipline  NOC       Event Event gender  \
0  1924  Chamonix     Skating  Figure skating  AUT  individual            M
1  1924  Chamonix     Skating  Figure skating  AUT  individual            W
2  1924  Chamonix     Skating  Figure skating  AUT       pairs            X
3  1924  Chamonix   Bobsleigh       Bobsleigh  BEL    four-man            M
4  1924  Chamonix  Ice Hockey      Ice Hockey  CAN  ice hockey            M

    Medal
0  Silver
1    Gold
2    Gold
3  Bronze
4    Gold
<ipython-input-54-fa16cfefe710>:30: FutureWarning: As the xlwt package is no longer maintained, the xlwt engine will be removed in a future version of pandas. This is the only engine in pandas that supports writing in the xls format. Install openpyxl and write to an xlsx file instead. You can set the option io.excel.xls.writer to 'xlwt' to silence this warning. While this option is deprecated and will also raise a warning, it can be globally set and the warning suppressed.
  df.to_excel(fullpath + ".xls")
los archivos se guardaron en: /home/lexus72/github/python-ml-course/datasets/athletes/medals
      Year      City       Sport      Discipline  NOC            Event  \
0     1924  Chamonix     Skating  Figure skating  AUT       individual
1     1924  Chamonix     Skating  Figure skating  AUT       individual
2     1924  Chamonix     Skating  Figure skating  AUT            pairs
3     1924  Chamonix   Bobsleigh       Bobsleigh  BEL         four-man
4     1924  Chamonix  Ice Hockey      Ice Hockey  CAN       ice hockey
...    ...       ...         ...             ...  ...              ...
2306  2006     Turin      Skiing       Snowboard  USA        Half-pipe
2307  2006     Turin      Skiing       Snowboard  USA        Half-pipe
2308  2006     Turin      Skiing       Snowboard  USA        Half-pipe
2309  2006     Turin      Skiing       Snowboard  USA  Snowboard Cross
2310  2006     Turin      Skiing       Snowboard  USA  Snowboard Cross

     Event gender   Medal
0               M  Silver
1               W    Gold
2               X    Gold
3               M  Bronze
4               M    Gold
...           ...     ...
2306            M  Silver
2307            W    Gold
2308            W  Silver
2309            M    Gold
2310            W  Silver

[2311 rows x 8 columns]